Revit 2024 API
ViewSchedule.CreateSchedule Method
Overload List
Name | Description
CreateSchedule(Document, ElementId)
 Creates a regular schedule.
CreateSchedule(Document, ElementId, ElementId)
 Creates a regular schedule that can relate to a specific area scheme.
See Also
ViewSchedule Class
ViewSchedule Members
Autodesk.Revit.DB Namespace